# -*- coding: utf-8 -*-
"""
05_panda_01b_20180817.py
Created on Tue Jan 24 15:21:41 2017

@author: zzjack
"""
import pandas as pd
from pandas import DataFrame,Series

#-------------------------------------------------------------------
#台灣高鐵203班次停靠時間如下字典:
THSR203={'南港':'','台北':'06:30','板橋':'06:38','桃園':'',
         '新竹':'','苗栗':'','台中':'07:20','彰化':'','嘉義':'07:45',
         '台南':'08:38','左營':'08:50'}
#練習一:將此時刻表轉成 Series Object s203
         
#練習二:將此時刻表未停靠站標明為 '未停靠'
         
#練習三:將未停靠站刪除
















#練習一解答:
s203=Series(THSR203) 
s203.name='到站時間'
s203.index.name='停靠站'  
s203

#練習二解答:
s203[s203=='']='未停靠'
s203

#練習三解答:
s203=s203[s203!='未停靠']

#進階練習參考解答:
#字典預設迭代取值是依key的排序,在此是筆劃順序
THSR203a={'A01南港':'','A02台北':'06:30','A03板橋':'06:38','A04桃園':'',
         'A05新竹':'','A06苗栗':'','A07台中':'07:20','A08彰化':'','A09嘉義':'07:45',
         'A10台南':'08:38','A11左營':'08:50'}
         
s203=Series(THSR203a) 
new_index=[i[3:] for i in s203.index]
s203.index=new_index


      
