A = 91
B = 75
C = 60
D = 75
E = 80
F = 90
G = 45
H = 95
I = 88
if A >= 90 :
    print ("員工A: 績效評分：",A ," 分, 加班時數20小時 -> 月薪 ",8000+(20*200))

if B >=70 and B <= 90:
    print ("員工B: 績效評分：",B ," 分, 加班時數15小時 -> 月薪 ",6000+(15*200))

if C <= 70 :
    print ("員工C: 績效評分：",C ," 分, 加班時數25小時 -> 月薪 ",4000+(25*200))

if D >=70 and B <= 90 :
    print ("員工D: 績效評分：",D ," 分, 加班時數10小時 -> 月薪 ",6000+(10*200))

if E >=70 and B <= 90:
    print ("員工E: 績效評分：",E ," 分, 加班時數12小時 -> 月薪 ",6000+(12*200))

if F >= 90 :
    print ("員工F: 績效評分：",F ," 分, 加班時數25小時 -> 月薪 ",8000+(25*200))

if G <= 70 :
    print ("員工D: 績效評分：",D ," 分, 加班時數10小時 -> 月薪 ",4000+(14*200))

if H >= 90 :
    print ("員工E: 績效評分：",E ," 分, 加班時數12小時 -> 月薪 ",8000+(13*200))

if I >=70 and B <= 90 :
    print ("員工F: 績效評分：",F ," 分, 加班時數25小時 -> 月薪 ",6000+(2*200))

def f(money , hr , name):
    if money >= 90 :
        print ("員工 ",name ,": 績效評分：", money ," 分, 加班時數", hr ,"小時 -> 月薪 ",8000+(hr*200))

    if money >=70 and money <= 90:
        print ("員工 ",name ,": 績效評分：", money ," 分, 加班時數", hr ,"小時 -> 月薪 ",6000+(hr*200))

    if money <= 70 :
        print ("員工 ",name ,": 績效評分：", money ," 分, 加班時數", hr ,"小時 -> 月薪 ",4000+(hr*200))

f(55 , 14 , "A")
f(96 , 13 , "B")
f(85 , 22 , "C")
    









